constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          24;
        startFace       2232;
    }
    outlet
    {
        type            patch;
        nFaces          8;
        startFace       2256;
    }
    wallBoundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       2264;
    }
    symmetricBoundary
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          48;
        startFace       2328;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2304;
        startFace       2376;
    }
)

// ************************************************************************* //
