0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
	value           uniform 0;
    }
    wallBoundary
    {
	type            zeroGradient;
    }
    symmetricBoundary
    {
	type            symmetry;
    }
    // upperWall
    // {
    //     type            zeroGradient;
    // }
    // lowerWall
    // {
    //     type            zeroGradient;
    // }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
